Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: PPV (Точность положительного прогноза)
en: PPV (Positive Predictive Value)

source: Precision-Recall кривая
en: Precision-Recall Curve

source: Отклик, %
en: Response, %

source: Диаграмма отклика (кумулятивная)
en: Response Chart (Cumulative)

source: Неверно задано максимальное число элементов в наборе
en: Invalid maximum item count in the set

source: % событий
en: % events

source: Обучающее множество
en: Training set

source: Качество бинарной классификации
en: Binary Classification Assessment

source: Во входных данных отсутствует столбец элементов транзакций
en: No transaction item column in the input data

source: Построение гистограммы
en: Building histogram

source: Расчет порядковых статистических показателей
en: Calculating ordinal statistics

source: Входной столбец должен иметь непрерывный вид данных
en: The input column must have continuous data kind

source: Входной источник данных не содержит столбец с заданным номером
en: No column with the specified number in the input data source

source: Установлены недопустимые границы интервалов гистограммы
en: Invalid histogram interval bounds set

source: Необходимо рассчитать простые статистики
en: Simple statistics need to be calculated

source: Элементы транзакций должны быть дискретного типа
en: Transaction items must relate to the discrete type

source: Основная коллекция значений гистограммы была удалена
en: The main collection of histogram values has been disposed

source: Отображение статистических показателей
en: Show statistical indicators

source: Ссылка на измерение "%s" не найдена. Не указано значение внешнего ключа.
en: Reference to "%s" dimension not found. The foreign key value not specified.

source: Ссылка на измерение "%s" не найдена. Измерение с первичным ключом "%s" в списке измерений не найдено.
en: Reference to "%s" dimension not found. The dimension with primary key "%s" was not found in the dimension list.

source: Ошибка при выполнении запроса к БД.
en: Error executing query to DB.

source: Не удалось считать информацию о версии Deductor Warehouse.
en: Failed to read version information about Deductor Warehouse version.

source: Ссылка на процесс "%s" не найдена. Не указано значение внешнего ключа.
en: Reference to "%s" process not found. The foreign key value not specified.

source: Ссылка на процесс "%s" не найдена. Процесс с первичным ключом "%s" в списке процессов не найден.
en: Reference to "%s" process not found. The process with primary key "%s" was not found in the process list.

source: Во входных данных отсутствует столбец идентификаторов транзакций
en: No transaction identifier column in the input data

source: Ошибка при чтении метаданных из БД. Для объекта с ID=%s, Имя="%s".
en: Error reading metadata from DB. For object with ID=%s, Name="%s".

source: Подключение к Хранилищу данных Deductor
en: Connector to the Deductor Data Warehouse

source: В строке "%d" значение измерения "%s" [%s] пустое.
en: Value of "%1:s" [%2:s] dimension in "%0:d" row is null.

source: Значение "%s" не найдено среди значений измерения "%s" [%s].
en: "%s" value was not found in "%s" [%s] dimension values.

source: В процессе выполнения очистки данных объекта "%s" [%s] возникла ошибка.
en: Error occurred while cleansing the data of "%s" [%s] object.

source: В процессе выполнения загрузки данных в измерение "%s" [%s] возникла ошибка.
en: Error occurred while loading data into "%s" [%s] dimension.

source: В процессе выполнения загрузки данных в процесс "%s" [%s] возникла ошибка.
en: Error occurred while loading data to "%s" [%s] process.

source: Процесс выполнения загрузки данных в процесс "%s" [%s] был отменен пользователем. Данные в ХД не загружены. Восстановление ограничений и индексов не выполнено.
en: The process of data loading into "%s" [%s] process has been cancelled by a user. Data is not loaded into DW. Indexes and constraints are not restored.

source: Удаление по измерению данных Процесса из Хранилища данных
en: Delete the Process from the Data Warehouse by data dimension

source: Тип данных не соответствует модели
en: Data type does not match the model

source: Отключение индексов и ограничений.
en: Disabling indexes and constraints.

source: Восстановление индексов и ограничений.
en: Restoring indexes and constraints.

source: Группировка данных Процесса перед загрузкой в Хранилище данных
en: Grouping Process data before loading it to Data Warehouse

source: Подготовка к удалению. Группировка данных по измерению.
en: Preparing to delete. Grouping data by dimension.

source: Загрузка данных Измерения в Хранилище данных
en: Loading the Dimension data into the Data Warehouse

source: Загрузка данных Процесса в Хранилище данных
en: Loading the Process data into the Data Warehouse

source: Подготовка измерений перед загрузкой в Хранилище данных
en: Preparing dimensions before upload into Data Warehouse

source: Данные строки "%d" не добавлены в ХД. Значение измерения "%s" [%s] пустое.
en: Data of "%d" row was not added to DW. "%s" [%s] dimension value is null.

source: Сбор статистики
en: Collecting statistics

source: Вспомогательные данные
en: Supplementary data

source: Загрузка данных в Хранилище данных Deductor
en: Loading data into the Deductor Data Warehouse

source: Извлечение данных из Хранилища данных Deductor
en: Extract data from a Deductor Data Warehouse

source: Данные в ХД не загружены. Возможные причины: Firebird - пробелы в конце строковых измерений; MS SQL - не учитывает регистр букв строковых измерений. Если было выставлено удаление данных по измерению - эти данные удалены из ХД. Возникла ошибка при восстановлении ограничений и индексов
en: Data is not loaded to DW. Possible reasons: Firebird - spaces at the end of string dimensions; MS SQL - case-insensitive letters of string dimensions. If data deletion is set by dimension, this data has been deleted from DW. Error occurred while restoring constraints and indexes

source: В процессе выполнения обновления куба "%s" [%s] возникла ошибка.
en: Error occurred while updating cube "%s" [%s].

source: Слишком длинное имя поля "%s". Могут возникнуть ошибки при выполнении SQL-запросов к ХД.
en: Name of "%s" field is too long. Errors may occur when executing SQL queries to DW.

source: Слишком длинное значение префикса "%s". Могут возникнуть ошибки при выполнении SQL-запросов к ХД.
en: Too long value of "%s" prefix. Errors may occur when executing SQL queries to DW.

source: Обновить Кубы в Хранилище данных
en: Update the Cubes in the Data Warehouse

source: Имя поля "%s" совпадает с зарезервированными словами. Могут возникнуть ошибки при выполнении SQL-запросов к ХД.
en: "%s" field name coincides with the reserved words. Errors may occur when executing SQL queries to DW.

source: Применение правил
en: Apply rules

source: Подключение к Хранилищу данных Deductor на СУБД Firebird
en: Connector to the Deductor Data Warehouse on Firebird DBMS

source: Подключение к Хранилищу данных Deductor на СУБД MS SQL
en: Connector to the Deductor Data Warehouse on MS SQL DBMS

source: Подключение к Хранилищу данных Deductor на СУБД Oracle
en: Connector to the Deductor Data Warehouse on Oracle DBMS

source: Подключение к Хранилищу данных
en: Connector to Data Warehouse

source: Для измерения "%s" не указано поле из источника данных.
en: No field from the data source specified for "%s" dimension.

source: Поле "%s" указанное для измерения "%s" в источнике данных не найдено.
en: "%s" field specified for "%s" dimension not found in the data source.

source: Поле "%s" указанное для "%s" в источнике данных не найдено.
en: "%s" field specified for "%s" not found in the data source.

source: Популярные наборы
en: Frequent sets

source: Не установлено соединение с Хранилищем данных
en: Not connected to Data Warehouse

source: Не указан объект Хранилища данных
en: Data Warehouse object not specified

source: Не найден объект хранилища данных с именем "%s".
en: No data warehouse object with "%s" name found.

source: Необходимо выбрать хотя бы один элемент
en: Select at least one item

source: В параметрах объекта "%s" (%s) найдена ошибка
en: Error found in "%s" (%s) object parameters

source: Ошибка при выполнении запроса к Хранилищу данных
en: Error executing query to Data Warehouse

source: Импортируемое поле "%s" (%s) не связано с объектом Хранилища данных
en: Imported "%s" (%s) field is not connected with the Data Warehouse object

source: Ассоциативные правила
en: Association rules

source: Выполнение запроса к Хранилищу данных
en: Executing query to Data Warehouse

source: Импорт данных из Хранилища данных
en: Importing data from Data Warehouse

source: Не найден объект Хранилища данных с именем "%s".
en: No data warehouse object with "%s" name found.

source: Объект хранилища данных с именем "%s" (%s) не найден
en: No data warehouse object with "%s" (%s) name found

source: Узел метаданных "%s" не принадлежит дереву метаданных
en: "%s" metadata node does not belong to the metadata tree

source: Значение даты не может быть пустым
en: Data value cannot be empty

source: Тип фильтрации "%s" не совместим
en: "%s" filter type incompatible

source: Список не может быть пустым
en: List cannot be empty

source: Количество пропущенных периодов не может быть меньше 1
en: Number of missed periods cannot be less than 1

source: Количество периодов не может быть меньше 1
en: Number of periods cannot be less than 1

source: Объект "%s" типа "%s" не может быть непрерывным
en: "%s" object of "%s" type cannot be continuous

source: Версии Deductor Warehouse не совпадают. Компонент: "%s". БД ХД: "%s"
en: Deductor Warehouse versions do not match. Component: "%s". DB DW: "%s"

source: Уже есть подузел указанного типа "%s"
en: Subnode of the specified "%s" type already exists

source: Поиск ассоциативных правил
en: Association rules search

source: АКФ
en: ACF

source: Ошибка подготовки полей запроса 1С
en: Error preparing 1C query fields

source: Автокорр.:
en: Autocorrelation:

source: Размеры входного источника данных превышают допустимые значения для расчета в частотной области
en: The input data source size exceeds the allowable values for calculation in the frequency domain

source: Размеры входного источника данных или число лагов превышают допустимые значения
en: The input data source size or lags number exceeds the allowable values

source: Лаг
en: Lag

source: Не указаны используемые столбцы
en: No used columns specified

source: ЧАКФ
en: PACF

source: Автокорреляция
en: Autocorrelation

source: Расчет значений автокорреляционной функции
en: Calculate autocorrelation function values

source: Квантование:
en: Binning:

source: Расчет гистограммы
en: Calculating histogram

source: Для столбца "%s" интервалы не пригодны для квантования
en: Bins for "%s" column are not valid for binning

source: Для заданных параметров не определены диапазоны
en: Bins not defined for the specified parameters

source: Не удалось создать квантователь
en: Failed to create quantizer

source: Не удалось сформировать интервалы квантования для поля "%s"
en: Failed to define binning ranges for "%s" field

source: Квантуемый источник данных не активный
en: Quantized data source is not active

source: Для заданных параметров не определён метод получения диапазонов
en: The binning method is not defined for the given parameters

source: Для столбца "%s" метод квантования не определён
en: Binning method unspecified for "%s" column

source: Модуль доступа к данным
en: Data access module

source: Нет доступного метода квантования для столбца "%s"
en: No binning method available for "%s" column

source: Не найден класс интервалов для формирования примера шаблона
en: No bin class found to generate the example template

source: Не упорядочены идентификаторы интервалов
en: Bin identifiers not ordered

source: Количество шаблонов не соответствует количеству типов данных
en: The template number does not match the data types number

source: Обработка выходных данных
en: Processing output data

source: Внешние диапазоны квантования
en: External binning ranges

source: Формирование интервалов квантования
en: Forming binning ranges

source: Не удалось сформировать интервалы для поля %s
en: Failed to generate bins for %s field

source: Нижняя граница не может быть больше верхней
en: The lower bound cannot exceed the upper one

source: Количество интервалов должно быть больше 0
en: Bin count must be more than 0

source: Количество интервалов не должно быть более %d
en: Bin count must not exceed %d

source: Для поля %s не удалось определить ширину интервала
en: Failed to define bin width for %s field

source: Не удалось получить интервалы квантования
en: Failed to generate binning ranges

source: Интервалы квантования для поля %s не созданы. Поле содержит значение "бесконечность"
en: Bins for %s field were not created. The field contains the "infinity" value

source: Входной столбец
en: Input column

source: Невозможно получить интервал для поля %s из строки %d
en: Failed to generate bin for %s field from row %d

source: Для поля %s начальная граница интервалов больше конечной границы
en: The initial bin boundary exceeds the final boundary for %s field

source: , для поля %s.
en: , for %s field.

source: Не задана нижняя граница диапазонов
en: No lower bins bound specified

source: Не найдены внешние интервалы
en: No external bins found

source: Не найдены границы внешних интервалов
en: No bounds for external bins found

source: Не удаётся получить СКО/среднее для поля %s
en: Failed to get SD/mean for %s field

source: Не удаётся получить минимум максимум для поля %s
en: Failed to get minimum maximum for %s field

source: Для целочисленного поля %s определено слишком много интервалов
en: Too many bins defined for %s integer field

source: Не задана верхняя граница диапазонов
en: No upper bins bound specified

source: Для целочисленного поля %s ширина интервалов должна быть >= 1
en: For %s integer field bin width must be >= 1

source: Некорректный тип данных интервалов
en: Invalid bin data type

source: Ширина интервала должна быть больше 0
en: Bin width must be more than 0

source: Для поля %s ширина интервала должна быть больше 0
en: Bin width must be more than 0 for %s field

source: Поле %s с нулевой дисперсией, будет создан только 1 интервал
en: %s field with zero variance, only 1 bin will be created

source: Поле %s с нулевой дисперсией, будут созданы только 3 интервала
en: %s field with zero variance, only 3 bins will be created

source: Выравнивание плиток поля %s
en: Aligning tiles for field %s

source: Количество плиток не должно быть более %d
en: Tiles number must not exceed %d

source: Для поля %s и метода %s, не сформирован контекст
en: Context not ready for %s field and %s method

source: Не удалось получить настройки для плиточного квантования
en: Failed to get tiled binning settings

source: Массив входных источников данных
en: Array of input data sources

source: Поле %s не содержит данных, получить интервалы невозможно
en: %s field contains no data, it is impossible to generate bins

source: Не удаётся получить сумму значений поля %s
en: Failed to get sum of values for %s field

source: Количество интервалов (плиток) должно быть > 0
en: Bin (tile) count must be > 0

source: Отрицательные значения недопустимы при формировании интервалов по сумме признака
en: Negative values are invalid while generating bins by indicator sum

source: Сортировка поля %s
en: Sorting field %s

source: Опция "Округлять границы" проигнорирована, т.к. параметр "Совпадающие наблюдения" равен "Одинаковые плитки"
en: "Round limits" option was ignored because "Ties" parameter is equal to "Assign optimal"

source: Для квантователя не определены интервалы
en: No bins defined for quantizer

source: Некорректное приведение типов
en: Invalid type cast

source: Тип данных не относится к непрерывным значениям
en: Data type does not comply with continuous values

source: Тип данных не относится к числовым значениям
en: Data type not related to the numeric values

source: Диапазоны для квантования
en: Binning ranges

source: Квантование
en: Binning

source: Пользовательское квантование данных
en: User binning

source: Превышено максимальное количество рекурсивных вызовов (%d) функции Data в выражении "%s". Для решения этой проблемы необходимо включить Кэширование.
en: Maximum number of (%d) recursive calls of Data function in "%s" expression exceeded. To solve this problem it is required to enable Caching.

source: В результате вычисления выражения "%s" получено значение строкового типа, оно несовместимо с заданным типом %s
en: Calculating expression "%s" resulted in a string value, which is incompatible with the set %s data type

source: Массивы переменного типа могут возвращать только промежуточные выражения (выражение "%s", строка %d)
en: Variant arrays can be returned by intermediate expressions only (expression "%s", row %d)

source: Не найдено входное поле для замены выражением "%s"
en: Input field to replace with expression "%s" not found

source: "%0:s" может быть входной переменной или промежуточным выражением. Чтобы разрешить неоднозначность используйте "%1:s%0:s" для обращения к переменной или переименуйте выражение "%0:s".
en: "%0:s" can be input variable or intermediate expression. To allow nonuniqueness, use "%1:s%0:s" to access the variable or rename "%0:s" expression.

source: Выражения с именем "%s" не существует
en: No expression with name "%s" exists

source: Элементы
en: Items

source: Поля, переменной или выражения с именем "%s" не существует
en: No field, variable or expression with "%s" name exists

source: Предварительный просмотр результатов вычислений
en: Previewing calculation results

source: Переменной с именем "%s" не существует
en: No variable with name "%s" exists

source: Калькулятор
en: Calculator

source: Создание вычисляемых полей
en: Create calculated fields

source: Ошибка разбора выражения "%s"
en: Error parsing "%s" expression

source: Ошибка вычисления выражения "%s", строка %d входного набора
en: Error calculating "%s" expression, row %d of the input dataset

source: В выражении "%s" используется неопределенная переменная %s
en: %1:s undefined variable used in "%0:s" expression

source: Неправильно расставлены скобки
en: Invalid bracket order

source: Некорректный символ "%s"
en: Invalid "%s" character

source: Неправильное выражение: "%s"
en: Invalid expression: "%s"

source: В строке %d имеется незакрытая строковая константа
en: Unclosed string constant in %d line

source: Выходной столбец
en: Output column

source: Ошибка подготовки запроса 1С
en: Error preparing 1C query

source: Неизвестная функция: %s
en: Unknown function: %s

source: Невозможно добавить выражение "%s", т.к. существует выражение "%s"
en: Failed to add expression "%s" as expression "%s" exists

source: Невозможно добавить выражение "%s", т.к. есть выражения по пути "%s."
en: Failed to add expression "%s" because expressions with "%s." path exist

source: Невозможно выполнить приведение типа данных для узла с идентификатором %d
en: Failed to perform type casting for the node with identifier %d

source: Превышено максимальное количество рекурсивных вызовов (%d) в выражении "%s".
en: Maximum number of recursive calls (%d) in expression "%s" exceeded.

source: Массивы переменного типа могут возвращать только промежуточные выражения (выражение "%s")
en: Variant arrays can be returned by intermediate expressions only (expression "%s")

source: Выходная таблица
en: Output table

source: Не найден входной узел для замены выражением "%s"
en: Input node to replace with expression "%s" not found

source: Узла, переменной или выражения с именем "%s" не существует
en: No node, variable or expression with name "%s" exists

source: Массив выходных таблиц
en: Array of output tables

source: Ошибка при создании объекта Array "%s". Число узлов %d превышает максимальную длину массива JavaScript: 4_294_967_295
en: Error creating the object Array "%s". The number of nodes %d exceeds maximum length of JavaScript array: 4_294_967_295

source: Ошибка вычисления выражения "%s", путь "%s"
en: Error calculating expression "%s", path "%s"

source: Калькулятор (дерево)
en: Calculator (Tree)

source: Создание вычисляемых узлов дерева
en: Creating calculatable tree nodes

source: Ошибка вычисления выражения "%s"
en: Error calculating "%s" expression

source: Не найдена входная переменная для замены выражением "%s"
en: Input variable to replace with expression "%s" not found

source: Ошибка при установке значения выражения "%s"
en: Error setting "%s" expression value

source: Число строк
en: Row count

source: Входной переменной или выражения с именем "%s" не существует
en: No input variable or expression with "%s" name exists

source: Калькулятор (переменные)
en: Calculator (variables)

source: Создание вычисляемых переменных
en: Creating calculated variables

source: Поиск кластеров
en: Clustering

source: Добавить строку
en: Add row

source: Типы идентификаторов транзакций не соответствуют
en: Transaction identifier types do not match

source: Дополнительный вход
en: Supplementary input

source: Параметры кластеров
en: Cluster parameters

source: Кластеризация транзакций
en: Transaction Clustering

source: Кластеризация транзакций алгоритмом CLOPE
en: CLOPE algorithm transaction clustering

source: Число итераций дообучения
en: Pretraining iteration count

source: Создать столбцы по описаниям
en: Create columns by definitions

source: Кластериз.:
en: Clustering:

source: Расстояние до центра кластера
en: Distance to cluster center

source: Минимальное число кластеров не может быть больше максимального числа кластеров
en: Minimum cluster count cannot exceed maximum cluster count

source: Удалить все столбцы
en: Delete all columns

source: Центры кластеров
en: Cluster centers

source: Кластеризация
en: Clustering

source: Кластеризация данных
en: Data clustering

source: Невозможно использовать разбиение для столбца %s.
en: Failed to apply binning for %s column.

source: Невозможно использовать начальные классы в качестве разбиения для столбца %s. Слишком много уникальных значений
en: Failed to apply fine classes for binning for %s column. There are too many unique values

source: Не удалось восстановить разбиение
en: Failed to restore binning

source: Удалить столбец
en: Delete column

source: Не удалось сохранить текущее разбиение
en: Failed to save current binning

source: Ожидается непрерывный вид данных у столбца %s
en: Continuous data kind of %s column expected

source: Ожидается дискретный вид данных у столбца %s
en: Discrete data kind of %s column expected

source: Выходное поле не содержит значение "%s"
en: The output field does not contain "%s" value

source: Внешнее разбиение для столбца "%s" задано некорректно
en: External binning for "%s" column incorrectly specified

source: Не определено выходное поле
en: Undefined output field

source: Выходное поле должно быть дискретным с 2 уникальными значениями
en: The output field must be discrete with 2 unique values

source: Число операций для разбиения входного источника данных превышает допустимое значение
en: Number of input data source binning operations exceeds the allowable value

source: Вид данных обрабатываемого столбца не определен
en: Data kind of the processed column not defined

source: Коэффициент равномерности
en: Uniformity coefficient

source: Получить значение ячейки таблицы
en: Get table cell value

source: Выходной столбец должен иметь дискретный вид данных и содержать ровно 2 уникальных значения
en: The output column must have the discrete data kind and contain exactly 2 unique values

source: Некорректное назначение поля "%s"
en: Incorrect "%s" field usage type
